backend/movies_app/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    if params[:genre]
      @movies = Movie.where("JSON_CONTAINS(genre_ids, ?)", params[:genre])
    else
      @movies = Movie.all

SELECT "movies".* FROM "movies" WHERE (popularity > 1000) ORDER BY "movies"."popularity" DESC
---
  def populars
    threshold = 1000
    @movies = Movie.where("popularity > ?", threshold).order(popularity: :desc)

SELECT "movies".* FROM "movies" WHERE (JSON_CONTAINS(genre_ids, '18'))
---
  def by_genre
    genre_id = params[:id]
    @movies = Movie.where("genre_ids LIKE ?", "%#{genre_id}%")

SELECT "movies".* FROM "movies" WHERE (vote_average > 8.5) ORDER BY "movies"."vote_average" DESC
---
  def top_rated
    threshold = 8
    @movies = Movie.where("vote_average > ?", threshold).order(vote_average: :desc)

SELECT "movies".* FROM "movies" WHERE (LOWER(title) LIKE '%avengers%')
SELECT 1 AS one FROM "movies" WHERE (LOWER(title) LIKE '%avengers%') LIMIT 1
---
  def search_by_name
    name = params[:name].downcase.strip
    normalized_name = name.gsub(/[^a-z0-9\s]/, '')
    keywords = normalized_name.split

    query = keywords.map { |word| "LOWER(REPLACE(title, '-', '')) LIKE ?" }.join(' AND ')
    query_params = keywords.map { |word| "%#{word}%" }

    movies = Movie.where(query, *query_params)

    if movies.any?