backend/movies_app/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'justun@hotmial' LIMIT 1
SELECT "movies".* FROM "movies" WHERE "movies"."movie_id" = '939243' LIMIT 1
SELECT 1 AS one FROM "movies" INNER JOIN "movies_users" ON "movies"."movie_id" = "movies_users"."movie_id" WHERE "movies_users"."user_id" = 1 AND "movies"."movie_id" = '939243' LIMIT 1
---
  def add_favorite
    user = User.find_by(email: params[:email]) # Buscar el usuario por correo
    movie = Movie.find_or_create_by(movie_params) # Buscar o crear la película

    if user && movie
      user.movies << movie unless user.movies.include?(movie) # Evitar duplicados

SELECT "users".* FROM "users" WHERE "users"."email" = 'alice@example.com' LIMIT 1
SELECT "movies".* FROM "movies" WHERE "movies"."movie_id" = '939243' LIMIT 1
SELECT 1 AS one FROM "users" WHERE "users"."email" = 'justyn@example.com' LIMIT 1
SELECT "movies".* FROM "movies" INNER JOIN "movies_users" ON "movies"."movie_id" = "movies_users"."movie_id" WHERE "movies_users"."user_id" = 1
SELECT 1 AS one FROM "movies" INNER JOIN "movies_users" ON "movies"."movie_id" = "movies_users"."movie_id" WHERE "movies_users"."user_id" = 1 AND "movies"."movie_id" = '939243' LIMIT 1
---
  def remove_favorite
    user = User.find_by(email: params[:email]) # Buscar el usuario por correo
    movie = Movie.find_by(movie_id: params[:movie][:movie_id]) # Buscar la película por su movie_id

    if user && movie && user.movies.include?(movie)

INSERT INTO "users" ("name", "last_name", "email", "password", "created_at", "updated_at") VALUES ('Justyn', 'Roldán', 'justyn@example.com', 'password123', '2025-01-25 03:38:19.603934', '2025-01-25 03:38:19.603934') RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."email" = 'alice@example.com' LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 5
---
  def destroy_by_email
    user = User.find_by(email: params[:email]) # Buscar usuario por email

    if user
      user.destroy

SELECT "users".* FROM "users" WHERE "users"."email" = 'alice@example.com' LIMIT 1
---
  def favorites
    user = User.find_by(email: params[:email]) # Buscar el usuario por correo